# Retail Sales Analysis – Week 2, Day 1

## Business Questions
1. Revenue by Product Category
2. Sales Seasonality
3. Customer Demographics

## Dataset
Source: Kaggle – Retail Sales Dataset (mohammadtalib786)

In [1]:
import pandas as pd

df = pd.read_csv("retail_sales_dataset.csv")

In [2]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   object
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
dtypes: int64(5), object(4)
memory usage: 70.4+ KB
None

In [3]:
df.describe()

       Transaction ID         Age     Quantity  Price per Unit  Total Amount
count     1000.000000  1000.00000  1000.000000     1000.000000   1000.000000
mean       500.500000    41.39200     2.514000      179.890000    456.000000
std        288.819436    13.68143     1.132734      189.681356    559.997632
min          1.000000    18.00000     1.000000       25.000000     25.000000
25%        250.750000    29.00000     1.000000       30.000000     60.000000
50%        500.500000    42.00000     3.000000       50.000000    135.000000
75%        750.250000    53.00000     4.000000      300.000000    900.000000
max       1000.000000    64.00000     4.000000      500.000000   2000.000000

In [4]:
df.isna().sum

<bound method DataFrame.sum of      Transaction ID   Date  Customer ID  Gender    Age  Product Category  \
0             False  False        False   False  False             False
1             False  False        False   False  False             False
2             False  False        False   False  False             False
3             False  False        False   False  False             False
4             False  False        False   False  False             False
..              ...    ...          ...     ...    ...               ...
995           False  False        False   False  False             False
996           False  False        False   False  False             False
997           False  False        False   False  False             False
998           False  False        False   False  False             False
999           False  False        False   False  False             False

     Quantity  Price per Unit  Total Amount
0       False           False         False
1       False           False         False
2       False           False         False
3       False           False         False
4       False           False         False
..        ...             ...           ...
995     False           False         False
996     False           False         False
997     False           False         False
998     False           False         False
999     False           False         False

[1000 rows x 9 columns]>

In [5]:
df["Date"] = pd.to_datetime(df["Date"])

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   datetime64[ns]
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
dtypes: datetime64[ns](1), int64(5), object(3)
memory usage: 70.4+ KB

In [7]:
df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100

In [8]:
df['calculated_total'] = df['Quantity'] * df['Price per Unit']
(df['calculated_total'] == df['Total Amount']).value_counts()

True    1000
Name: count, dtype: int64

In [9]:
df.sample

<bound method NDFrame.sample of      Transaction ID       Date Customer ID  Gender  Age Product Category  \
0                 1 2023-11-24     CUST001    Male   34           Beauty
1                 2 2023-02-27     CUST002  Female   26         Clothing
2                 3 2023-01-13     CUST003    Male   50      Electronics
3                 4 2023-05-21     CUST004    Male   37         Clothing
4                 5 2023-05-06     CUST005    Male   30           Beauty
..              ...        ...         ...     ...  ...              ...
995             996 2023-05-16     CUST996    Male   62         Clothing
996             997 2023-11-17     CUST997    Male   52           Beauty
997             998 2023-10-29     CUST998  Female   23           Beauty
998             999 2023-12-05     CUST999  Female   36      Electronics
999            1000 2023-04-12    CUST1000    Male   47      Electronics

     Quantity  Price per Unit  Total Amount  calculated_total
0           3              50           150               150
1           2             500          1000              1000
2           1              30            30                30
3           1             500           500               500
4           2              50           100               100
..        ...             ...           ...               ...
995         1              50            50                50
996         3              30            90                90
997         4              25           100               100
998         3              50           150               150
999         4              30           120               120

[1000 rows x 10 columns]>

In [10]:
df.sample()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,calculated_total
41,42,2023-02-17,CUST042,Male,22,Clothing,3,300,900,900

In [11]:
df = df.drop(columns=['calculated_total'])

In [12]:
df.columns

Index(['Transaction ID', 'Date', 'Customer ID', 'Gender', 'Age',
       'Product Category', 'Quantity', 'Price per Unit', 'Total Amount'],
      dtype='object')

In [13]:
df.sample

<bound method NDFrame.sample of      Transaction ID       Date Customer ID  Gender  Age Product Category  \
0                 1 2023-11-24     CUST001    Male   34           Beauty
1                 2 2023-02-27     CUST002  Female   26         Clothing
2                 3 2023-01-13     CUST003    Male   50      Electronics
3                 4 2023-05-21     CUST004    Male   37         Clothing
4                 5 2023-05-06     CUST005    Male   30           Beauty
..              ...        ...         ...     ...  ...              ...
995             996 2023-05-16     CUST996    Male   62         Clothing
996             997 2023-11-17     CUST997    Male   52           Beauty
997             998 2023-10-29     CUST998  Female   23           Beauty
998             999 2023-12-05     CUST999  Female   36      Electronics
999            1000 2023-04-12    CUST1000    Male   47      Electronics

     Quantity  Price per Unit  Total Amount
0           3              50           150
1           2             500          1000
2           1              30            30
3           1             500           500
4           2              50           100
..        ...             ...           ...
995         1              50            50
996         3              30            90
997         4              25           100
998         3              50           150
999         4              30           120

[1000 rows x 9 columns]>

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   datetime64[ns]
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
dtypes: datetime64[ns](1), int64(5), object(3)
memory usage: 70.4+ KB

# Day 2: Feature Engineering and Data Quality Check

In [18]:
df['Year'] = df['Date'].dt.year

In [19]:
df['Year']

0      2023
1      2023
2      2023
3      2023
4      2023
       ...
995    2023
996    2023
997    2023
998    2023
999    2023
Name: Year, Length: 1000, dtype: int32

In [21]:
(df['Year'] == 2023).value_counts()

Year
True     998
False      2
Name: count, dtype: int64

In [22]:
df['Year'] != 2023

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: Year, Length: 1000, dtype: bool

In [33]:
df['Month_name'] = df['Date'].dt.month_name()

In [34]:
df['Month']

0      November
1      February
2       January
3           May
4           May
         ...
995         May
996    November
997     October
998    December
999       April
Name: Month, Length: 1000, dtype: object

In [30]:
df['Day'] = df['Date'].dt.day

In [31]:
df['Day_name'] = df['Date'].dt.day_name()

In [32]:
df['Day_name']

0         Friday
1         Monday
2         Friday
3         Sunday
4       Saturday
         ...
995      Tuesday
996       Friday
997       Sunday
998      Tuesday
999    Wednesday
Name: Day_name, Length: 1000, dtype: object

In [35]:
df.sample()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Yaer,Year,Month,Day,Day_name,Month_name
732,733,2023-08-29,CUST733,Male,34,Beauty,1,30,30,8,2023,August,29,Tuesday,August

In [36]:
df = df.drop(columns='Yaer')

In [38]:
df.sample()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Year,Month,Day,Day_name,Month_name
731,732,2023-02-11,CUST732,Male,61,Electronics,2,500,1000,2023,February,11,Saturday,February

In [39]:
df['Month'] = df['Date'].dt.month

In [40]:
df.sample()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Year,Month,Day,Day_name,Month_name
742,743,2023-01-16,CUST743,Female,34,Beauty,4,500,2000,2023,1,16,Monday,January

In [43]:
df = df[['Transaction ID',	'Date',	'Customer ID',	'Gender',	'Age',	'Product Category',	'Quantity',	'Price per Unit', 'Total Amount',	'Year',	'Month', 'Month_name', 	'Day',	'Day_name'	]]

In [44]:
df.sample()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Year,Month,Month_name,Day,Day_name
962,963,2023-11-14,CUST963,Female,55,Beauty,1,50,50,2023,11,November,14,Tuesday

In [45]:
df[df['Year'] != 2023]

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Year,Month,Month_name,Day,Day_name
210,211,2024-01-01,CUST211,Male,42,Beauty,3,500,1500,2024,1,January,1,Monday
649,650,2024-01-01,CUST650,Male,55,Electronics,1,30,30,2024,1,January,1,Monday

In [46]:
df[df['Age'] < 18]

Empty DataFrame
Columns: [Transaction ID, Date, Customer ID, Gender, Age, Product Category, Quantity, Price per Unit, Total Amount, Year, Month, Month_name, Day, Day_name]
Index: []

In [47]:
df[df['Price per Unit'] <= 0]

Empty DataFrame
Columns: [Transaction ID, Date, Customer ID, Gender, Age, Product Category, Quantity, Price per Unit, Total Amount, Year, Month, Month_name, Day, Day_name]
Index: []

In [48]:
df[df['Age'] < 100]

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Year,Month,Month_name,Day,Day_name
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150,2023,11,November,24,Friday
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000,2023,2,February,27,Monday
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30,2023,1,January,13,Friday
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500,2023,5,May,21,Sunday
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100,2023,5,May,6,Saturday
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,2023-05-16,CUST996,Male,62,Clothing,1,50,50,2023,5,May,16,Tuesday
996,997,2023-11-17,CUST997,Male,52,Beauty,3,30,90,2023,11,November,17,Friday
997,998,2023-10-29,CUST998,Female,23,Beauty,4,25,100,2023,10,October,29,Sunday
998,999,2023-12-05,CUST999,Female,36,Electronics,3,50,150,2023,12,December,5,Tuesday
999,1000,2023-04-12,CUST1000,Male,47,Electronics,4,30,120,2023,4,April,12,Wednesday

In [50]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [51]:
df['Product Category'].unique()

array(['Beauty', 'Clothing', 'Electronics'], dtype=object)

In [61]:
df.groupby(['Month', 'Month_name'])['Total Amount'].sum().droplevel(0)

Month_name
January      36980
February     44060
March        28990
April        33870
May          53150
June         36715
July         35465
August       36960
September    23620
October      46580
November     34920
December     44690
Name: Total Amount, dtype: int64

In [69]:
df.groupby('Day_name')['Total Amount'].mean().reindex(
    ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']).round(2)

Day_name
Monday       481.16
Tuesday      431.30
Wednesday    422.81
Thursday     437.68
Friday       463.57
Saturday     525.43
Sunday       424.64
Name: Total Amount, dtype: float64

In [82]:
df.pivot_table(
    values='Total Amount',
    index=['Month','Month_name'],
    columns='Product Category',
    aggfunc='sum'
).droplevel(0)

Product Category  Beauty  Clothing  Electronics
Month_name
January            13930     13125         9925
February           14035     14560        15465
March              10545     15065         3380
April              11905     13940         8025
May                12450     17455        23245
June               10995     10170        15550
July               16090      8250        11125
August              9790     12455        14715
September           6320      9975         7325
October            15355     13315        17910
November            9700     15200        10020
December           12400     12070        20220